In [562]:
# Import Libraries and Dependencies
import pandas as pd

### 1. Combine and Clean the Data
#### Import CSVs

In [563]:
# Read the CSV files into DataFrames.
df_2020 = pd.read_csv('Resources/athletic_sales_2020.csv') 
df_2021 = pd.read_csv('Resources/athletic_sales_2021.csv')

In [564]:
# Display the shape of 2020 sales DataFrame
df_2020.shape

(1297, 12)

In [565]:
# Display the shape of 2021 sales DataFrame
df_2021.shape

(8346, 12)

In [566]:
# Display the 2020 sales DataFrame
df_2020.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [567]:
# Display the 2021 sales DataFrame

df_2021.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,65,750,487500,121875.00,Outlet
1,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,51,233,11883,3208.41,Outlet
2,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,50,275,137500,82500.00,Outlet
3,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,47,77,3619,2714.25,Online
4,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,64,225,14400,5184.00,Online

#### Check the data types of each DataFrame

In [568]:
# Check the 2020 sales data types.
df_2020.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [569]:
# Check the 2021 sales data types.
df_2021.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

#### Combine the sales data by rows.

In [570]:
# Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.
# I choose concat because  with ignore_index=True concat is slightly faster.

# While the Pandas .merge(),.join(), and .concat() methods are all used to combine Data Frames, 
# they all have different use-cases. Mmerge is a useful function for combining Data Frames on specific columns. 
# Join is a useful function for combining along indexes or key columns. 
# Lastly, concat is most useful for combining along either axis or for multi-indexing.

df = pd.concat([df_2020, df_2021], ignore_index=True)
df.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [571]:
# Display the shape of the combined sales DataFrame
df.shape

(9643, 12)

In [572]:
# Check if any values are null.
null_df = df.isnull().sum()
print(null_df)

retailer            0
retailer_id         0
invoice_date        0
region              0
state               0
city                0
product             0
price_per_unit      0
units_sold          0
total_sales         0
operating_profit    0
sales_method        0
dtype: int64

In [573]:
# Check the data type of each column
df.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [574]:
# Convert the "invoice_date" to a datetime datatype
from datetime import datetime
df['invoice_date'] = pd.to_datetime(df['invoice_date'],format='mixed')

df.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,2020-01-01,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,2020-01-01,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,2020-01-01,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,2020-01-01,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,2020-01-01,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [575]:
# Confirm that the "invoice_date" data type has been changed.
df.dtypes

retailer                    object
retailer_id                  int64
invoice_date        datetime64[ns]
region                      object
state                       object
city                        object
product                     object
price_per_unit               int64
units_sold                   int64
total_sales                  int64
operating_profit           float64
sales_method                object
dtype: object

### 2. Determine which Region Sold the Most Products

#### Using `groupby`

In [576]:
# Show the number products sold for region, state, and city.
# Rename the sum to "Total_Products_Sold".
grouped = df.groupby(['region','state','city']).apply(lambda g: pd.Series({"Total_Products_Sold": g["units_sold"].sum()})).sort_values( by=['Total_Products_Sold'] )

# Show the top 5 results.
grouped.nlargest(5, ['Total_Products_Sold'])

                                    Total_Products_Sold
region    state      city
Northeast New York   New York                    111954
South     Texas      Houston                      90322
West      California San Francisco                85478
                     Los Angeles                  76384
Southeast Florida    Miami                        73135

#### Using `pivot_table`

In [577]:
# Show the number products sold for region, state, and city.
# Rename the sum to "Total_Products_Sold".

piv = df.reset_index().pivot_table(index=['region', 'state', 'city'],values='units_sold', aggfunc = "sum", fill_value = 0)

piv = piv.rename(columns={'units_sold': 'Total_Products_Sold'})
piv = piv.sort_values('Total_Products_Sold',axis=0,ascending=False)

# Show the top 5 results.
piv.nlargest(5, ['Total_Products_Sold'])

                                    Total_Products_Sold
region    state      city
Northeast New York   New York                    111954
South     Texas      Houston                      90322
West      California San Francisco                85478
                     Los Angeles                  76384
Southeast Florida    Miami                        73135

### 3. Determine which Region had the Most Sales

#### Using `groupby`

In [578]:
# Show the total sales for the products sold for each region, state, and city.
# Rename the "total_sales" column to "Total Sales"
grouped = df.groupby(['region','state','city']).apply(lambda g: pd.Series({"Total Sales": g["total_sales"].sum()})).sort_values( by=['Total Sales'] )

# Show the top 5 results.
grouped.nlargest(5, ['Total Sales'])

                                        Total Sales
region    state          city
Northeast New York       New York          39801235
West      California     San Francisco     33973228
Southeast Florida        Miami             31600863
          South Carolina Charleston        29285637
          Florida        Orlando           27682851

#### Using `pivot_table`

In [579]:
# Show the total sales for the products sold for each region, state, and city.

piv = df.reset_index().pivot_table(index=['region', 'state', 'city'],values='total_sales', aggfunc = "sum", fill_value = 0)

# Optional: Rename the "total_sales" column to "Total Sales"
piv = piv.rename(columns={'total_sales': 'Total Sales'})
piv = piv.sort_values('Total Sales',axis=0,ascending=False)

# Show the top 5 results.
piv.nlargest(5, ['Total Sales'])

                                        Total Sales
region    state          city
Northeast New York       New York          39801235
West      California     San Francisco     33973228
Southeast Florida        Miami             31600863
          South Carolina Charleston        29285637
          Florida        Orlando           27682851

### 4. Determine which Retailer had the Most Sales

#### Using `groupby`

In [580]:
# Show the total sales for the products sold for each retailer, region, state, and city.
# Rename the "total_sales" column to "Total Sales"
grouped = df.groupby(['retailer','region','state','city']).apply(lambda g: pd.Series({"Total Sales": g["total_sales"].sum()})).sort_values( by=['Total Sales'] )

# Show the top 5 results.
grouped.nlargest(5, ['Total Sales'])

                                                    Total Sales
retailer    region    state          city
West Gear   West      California     San Francisco     32794405
Kohl's      West      California     Los Angeles       25127160
Foot Locker Northeast New York       New York          25008568
West Gear   West      Washington     Seattle           24862675
Foot Locker Southeast South Carolina Charleston        24822280

#### Using `pivot_table`

In [581]:
# Show the total sales for the products sold for each retailer, region, state, and city.
piv = df.reset_index().pivot_table(index=['retailer', 'region', 'state', 'city'],values='total_sales', aggfunc = "sum", fill_value = 0)

# Optional: Rename the "total_sales" column to "Total Sales"
piv = piv.rename(columns={'total_sales': 'Total Sales'})
piv = piv.sort_values('Total Sales',axis=0,ascending=False)

# Show the top 5 results.
piv.nlargest(5, ['Total Sales'])

                                                    Total Sales
retailer    region    state          city
West Gear   West      California     San Francisco     32794405
Kohl's      West      California     Los Angeles       25127160
Foot Locker Northeast New York       New York          25008568
West Gear   West      Washington     Seattle           24862675
Foot Locker Southeast South Carolina Charleston        24822280

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

In [582]:
# Filter the sales data to get the women's athletic footwear sales data.
# Women's Apparel	
# Women's Street Footwear
# Women's Athletic Footwear	
options = ['Women\'s Athletic Footwear'] 
   
# selecting rows based on condition 
woman_athletic_footwear_df = df[df['product'].isin(options)] 
woman_athletic_footwear_df.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
21,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,36,281,10116,3742.92,Outlet
22,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,41,247,10127,4658.42,Online
23,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,45,850,382500,133875.00,In-store
26,West Gear,1128299,2020-01-05,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,45,300,135000,47250.00,Outlet
27,West Gear,1128299,2020-01-05,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,34,90,3060,1254.60,Outlet

#### Using `groupby`

In [583]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
grouped = woman_athletic_footwear_df.groupby(['retailer','region','state','city']).apply(lambda g: pd.Series({"Womens_Footwear_Units_Sold": g["units_sold"].sum()})).sort_values( by=['Womens_Footwear_Units_Sold'] )

# Show the top 5 results.
grouped.nlargest(5, ['Womens_Footwear_Units_Sold'])

                                                      Womens_Footwear_Units_Sold
retailer      region    state          city
West Gear     West      California     San Francisco                       12107
Foot Locker   Northeast New York       New York                            10996
Kohl's        West      California     Los Angeles                         10826
Foot Locker   Southeast South Carolina Charleston                           8814
Sports Direct South     Texas          Dallas                               8790

#### Using `pivot_table`

In [584]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.

piv = woman_athletic_footwear_df.reset_index().pivot_table(index=['retailer', 'region', 'state', 'city'],values='units_sold', aggfunc = "sum", fill_value = 0)

# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
piv = piv.rename(columns={'units_sold': 'Womens_Footwear_Units_Sold'})
piv = piv.sort_values('Womens_Footwear_Units_Sold',axis=0,ascending=False)

# Show the top 5 results.
piv.nlargest(5, ['Womens_Footwear_Units_Sold'])

                                                      Womens_Footwear_Units_Sold
retailer      region    state          city
West Gear     West      California     San Francisco                       12107
Foot Locker   Northeast New York       New York                            10996
Kohl's        West      California     Los Angeles                         10826
Foot Locker   Southeast South Carolina Charleston                           8814
Sports Direct South     Texas          Dallas                               8790

### 5. Determine the Day with the Most Women's Athletic Footwear Sales

In [593]:
# Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values.
piv = woman_athletic_footwear_df.reset_index().pivot_table(index=['invoice_date'],values='total_sales', aggfunc = "sum", fill_value = 0)

# Optional: Rename the "total_sales" column to "Total Sales"
piv = piv.rename(columns={'total_sales': 'Total Sales'})
piv = piv.sort_values('Total Sales',axis=0,ascending=False)

# Show the table.
piv.nlargest(500, ['Total Sales'])

              Total Sales
invoice_date
2021-07-16        1521825
2021-12-16        1473497
2021-06-17        1376988
2021-08-17        1086294
2021-07-23        1021806
...                   ...
2021-02-03          19210
2021-10-27          17916
2021-05-30          15406
2020-11-07           8974
2020-11-01           8974

[355 rows x 1 columns]

In [586]:
# Resample the pivot table into daily bins, and get the total sales for each day.


# Sort the resampled pivot table in ascending order on "Total Sales".

### 6.  Determine the Week with the Most Women's Athletic Footwear Sales

In [587]:
# Resample the pivot table into weekly bins, and get the total sales for each week.


# Sort the resampled pivot table in ascending order on "Total Sales".